OLA : 

Problem_statement : 

Whether drivers leave the company dues to various factors like age, gender, joining date and salary etc and try to predict the churn.

In [1]:
# import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('ola_driver_scaler.csv')

In [3]:
df.head(12)

,Unnamed: 0,MMM-YY,Driver_ID,Age,Gender,City,Education_Level,Income,Dateofjoining,LastWorkingDate,Joining Designation,Grade,Total Business Value,Quarterly Rating
0,0,01/01/19,1,28.0,0.0,C23,2,57387,24/12/18,NaN,1,1,2381060,2
1,1,02/01/19,1,28.0,0.0,C23,2,57387,24/12/18,NaN,1,1,-665480,2
2,2,03/01/19,1,28.0,0.0,C23,2,57387,24/12/18,03/11/19,1,1,0,2
3,3,11/01/20,2,31.0,0.0,C7,2,67016,11/06/20,NaN,2,2,0,1
4,4,12/01/20,2,31.0,0.0,C7,2,67016,11/06/20,NaN,2,2,0,1
5,5,12/01/19,4,43.0,0.0,C13,2,65603,12/07/19,NaN,2,2,0,1
6,6,01/01/20,4,43.0,0.0,C13,2,65603,12/07/19,NaN,2,2,0,1
7,7,02/01/20,4,43.0,0.0,C13,2,65603,12/07/19,NaN,2,2,0,1
8,8,03/01/20,4,43.0,0.0,C13,2,65603,12/07/19,NaN,2,2,350000,1
9,9,04/01/20,4,43.0,0.0,C13,2,65603,12/07/19,27/04/20,2,2,0,1
10,10,01/01/19,5,29.0,0.0,C9,0,46368,01/09/19,NaN,1,1,0,1
11,11,02/01/19,5,29.0,0.0,C9,0,46368,01/09/19,NaN,1,1,120360,1

Need to somehow bring the data each driver level

In [4]:
df.drop(columns='Unnamed: 0',inplace=True)

In [5]:
df.shape

(19104, 13)

In [9]:
df.isna().sum() / len(df)  * 100

MMM-YY                   0.000000
Driver_ID                0.000000
Age                      0.319305
Gender                   0.272194
City                     0.000000
Education_Level          0.000000
Income                   0.000000
Dateofjoining            0.000000
LastWorkingDate         91.541039
Joining Designation      0.000000
Grade                    0.000000
Total Business Value     0.000000
Quarterly Rating         0.000000
dtype: float64

Assumption : if the last working date is NaN that could possibly mean that the drivers stopped reporting to OLA or quit or changed the company.

In [7]:
df.duplicated().sum()

0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19104 entries, 0 to 19103
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   MMM-YY                19104 non-null  object
 1   Driver_ID             19104 non-null  int64
 2   Age                   19043 non-null  float64
 3   Gender                19052 non-null  float64
 4   City                  19104 non-null  object
 5   Education_Level       19104 non-null  int64
 6   Income                19104 non-null  int64
 7   Dateofjoining         19104 non-null  object
 8   LastWorkingDate       1616 non-null   object
 9   Joining Designation   19104 non-null  int64
 10  Grade                 19104 non-null  int64
 11  Total Business Value  19104 non-null  int64
 12  Quarterly Rating      19104 non-null  int64
dtypes: float64(2), int64(7), object(4)
memory usage: 1.9+ MB

In [11]:
for each in  ["MMM-YY","Dateofjoining","LastWorkingDate"] : 
    df[each] = pd.to_datetime(df[each])

Missing value imputation :

Gender : Gender of the driver – Male : 0, Female: 1

In [27]:
# age , gender , last working date 

df["Gender"].value_counts(dropna=False)

0.0    11074
1.0     7978
NaN       52
Name: Gender, dtype: int64

Education_Level : Education level – 0 for 10+ ,1 for 12+ ,2 for graduate

In [28]:
df["Education_Level"].value_counts()

1    6864
2    6327
0    5913
Name: Education_Level, dtype: int64

Let's try Knn imputation -  for this we need to consider the numerical features

In [30]:
num_df = df.select_dtypes(np.number)

In [32]:
num_df.columns

Index(['Driver_ID', 'Age', 'Gender', 'Education_Level', 'Income',
       'Joining Designation', 'Grade', 'Total Business Value',
       'Quarterly Rating'],
      dtype='object')

In [33]:
num_df.drop(columns='Driver_ID',inplace=True)

In [35]:
# knn imputation 

from sklearn.impute import KNNImputer

imputer = KNNImputer(n_neighbors=5, weights='uniform', metric='nan_euclidean',)

df[num_df.columns] = imputer.fit_transform(df[num_df.columns])

nan_euclidean trivia :

The nan_euclidean metric is a special metric provided by scikit-learn's PairwiseDistances class specifically for handling missing values (NaNs) in the data. It is similar to the Euclidean distance metric, but it treats NaNs as a separate category and assigns a large distance to any pair of samples that contains at least one NaN.

This is useful when you have missing values in your data and you want to impute them using the KNNImputer. By using the nan_euclidean metric, the KNNImputer will ignore the NaNs when finding the nearest neighbors, ensuring that the imputed values are based on the non-missing data.

In [36]:
df.isna().sum() / len(df)  * 100

MMM-YY                   0.000000
Driver_ID                0.000000
Age                      0.000000
Gender                   0.000000
City                     0.000000
Education_Level          0.000000
Income                   0.000000
Dateofjoining            0.000000
LastWorkingDate         91.541039
Joining Designation      0.000000
Grade                    0.000000
Total Business Value     0.000000
Quarterly Rating         0.000000
dtype: float64

let's bring down the data to the each driver level :

In [37]:
df[df["Driver_ID"] == 500]

,MMM-YY,Driver_ID,Age,Gender,City,Education_Level,Income,Dateofjoining,LastWorkingDate,Joining Designation,Grade,Total Business Value,Quarterly Rating
3342,2019-01-01,500,39.0,0.0,C12,1.0,103119.0,2018-05-11,NaT,4.0,4.0,612140.0,1.0
3343,2019-02-01,500,39.0,0.0,C12,1.0,103119.0,2018-05-11,NaT,4.0,4.0,508740.0,1.0
3344,2019-03-01,500,39.0,0.0,C12,1.0,103119.0,2018-05-11,NaT,4.0,4.0,1683170.0,1.0
3345,2019-04-01,500,39.0,0.0,C12,1.0,103119.0,2018-05-11,NaT,4.0,4.0,402470.0,1.0
3346,2019-05-01,500,39.0,0.0,C12,1.0,103119.0,2018-05-11,NaT,4.0,4.0,0.0,1.0
3347,2019-06-01,500,39.0,0.0,C12,1.0,103119.0,2018-05-11,NaT,4.0,4.0,0.0,1.0
3348,2019-07-01,500,40.0,0.0,C12,1.0,103119.0,2018-05-11,NaT,4.0,4.0,300000.0,3.0
3349,2019-08-01,500,40.0,0.0,C12,1.0,103119.0,2018-05-11,NaT,4.0,4.0,2654880.0,3.0
3350,2019-09-01,500,40.0,0.0,C12,1.0,103119.0,2018-05-11,NaT,4.0,4.0,1435040.0,3.0
3351,2019-10-01,500,40.0,0.0,C12,1.0,103119.0,2018-05-11,2019-10-10,4.0,4.0,0.0,1.0

The data is at montly level and we need to bring it to the driver level and if we observe each driver reports at OLA driver hub at the start of the month , first let's do a groupby at the driver level, then monthly level

In [40]:
# age : max , gender : first , city : first  , education : last , income :  last , dateofjoining : last , 
# lastworkingdate : last , joining designation : last , grade : last , total business value : sum , quarterly rating : last

agg_dict = {'Age':'max', 'Gender':'first','City':'first',
             'Education_Level':'last','Income':'last',
             'Dateofjoining':'last','LastWorkingDate':'last',
             'Joining Designation':'last','Grade':'last',
             'Total Business Value':'sum','Quarterly Rating':'last'}

df1 = df.groupby(['Driver_ID','MMM-YY']).aggregate(agg_dict)

Now the data is at driver level for each month

In [41]:
df1

                       Age  Gender City  Education_Level   Income  \
Driver_ID MMM-YY
1         2019-01-01  28.0     0.0  C23              2.0  57387.0
          2019-02-01  28.0     0.0  C23              2.0  57387.0
          2019-03-01  28.0     0.0  C23              2.0  57387.0
2         2020-11-01  31.0     0.0   C7              2.0  67016.0
          2020-12-01  31.0     0.0   C7              2.0  67016.0
...                    ...     ...  ...              ...      ...
2788      2020-08-01  30.0     0.0  C27              2.0  70254.0
          2020-09-01  30.0     0.0  C27              2.0  70254.0
          2020-10-01  30.0     0.0  C27              2.0  70254.0
          2020-11-01  30.0     0.0  C27              2.0  70254.0
          2020-12-01  30.0     0.0  C27              2.0  70254.0

                     Dateofjoining LastWorkingDate  Joining Designation  \
Driver_ID MMM-YY
1         2019-01-01    2018-12-24             NaT                  1.0
          2019-02-01    2018-12-24             NaT                  1.0
          2019-03-01    2018-12-24      2019-03-11                  1.0
2         2020-11-01    2020-11-06             NaT                  2.0
          2020-12-01    2020-11-06             NaT                  2.0
...                            ...             ...                  ...
2788      2020-08-01    2020-06-08             NaT                  2.0
          2020-09-01    2020-06-08             NaT                  2.0
          2020-10-01    2020-06-08             NaT                  2.0
          2020-11-01    2020-06-08             NaT                  2.0
          2020-12-01    2020-06-08             NaT                  2.0

                      Grade  Total Business Value  Quarterly Rating
Driver_ID MMM-YY
1         2019-01-01    1.0             2381060.0               2.0
          2019-02-01    1.0             -665480.0               2.0
          2019-03-01    1.0                   0.0               2.0
2         2020-11-01    2.0                   0.0               1.0
          2020-12-01    2.0                   0.0               1.0
...                     ...                   ...               ...
2788      2020-08-01    2.0              740280.0               3.0
          2020-09-01    2.0              448370.0               3.0
          2020-10-01    2.0                   0.0               2.0
          2020-11-01    2.0              200420.0               2.0
          2020-12-01    2.0              411480.0               2.0

[19104 rows x 11 columns]

In [43]:
df1.index

MultiIndex([(   1, '2019-01-01'),
            (   1, '2019-02-01'),
            (   1, '2019-03-01'),
            (   2, '2020-11-01'),
            (   2, '2020-12-01'),
            (   4, '2019-12-01'),
            (   4, '2020-01-01'),
            (   4, '2020-02-01'),
            (   4, '2020-03-01'),
            (   4, '2020-04-01'),
            ...
            (2787, '2019-04-01'),
            (2787, '2019-05-01'),
            (2787, '2019-06-01'),
            (2788, '2020-06-01'),
            (2788, '2020-07-01'),
            (2788, '2020-08-01'),
            (2788, '2020-09-01'),
            (2788, '2020-10-01'),
            (2788, '2020-11-01'),
            (2788, '2020-12-01')],
           names=['Driver_ID', 'MMM-YY'], length=19104)